# IsDocumentTransmitted Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransmissionData..::..IsDocumentTransmitted Method
TransmissionData Class See Also
---
Determines whether the document at a given file location is transmitted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static bool IsDocumentTransmitted(
	ModelPath filePath
)
```

Visual Basic
---
```text
Public Shared Function IsDocumentTransmitted ( _
	filePath As ModelPath _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsDocumentTransmitted(
	ModelPath^ filePath
)
```

# ### Parameters
filePath
    Type: Autodesk.Revit.DB..::..ModelPath The path to the document whose transmitted state will be checked.
# ### Return Value
True if the document is a transmitted file, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TransmissionData Class
Autodesk.Revit.DB Namespace